Autodesk.Revit.DB.Mechanical.FlexDuct.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new flexible duct into the document, using a point array and flexible duct type.
document:
The document.
systemTypeId:
The id of the HVAC system type.
ductTypeId:
The id of the flexible duct.
levelId:
The level id for the flexible duct.
startTangent:
The tangent vector at the start of the curve. The invalid or zero vector is ignored.
endTangent:
The tangent vector at the end of the curve. The invalid or zero vector is ignored.
points:
The point array indicating the path of the flexible duct, including the end point.
Returns:
If creation was successful then a new flexible duct is returned, otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid HVAC system type.
-or-
The type ductTypeId is not valid flexible duct type.
-or-
The level id levelId is not valid.
-or-
The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014

Autodesk.Revit.DB.Mechanical.FlexDuct.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new flexible duct into the document, using a point array and flexible duct type.
document:
The document.
systemTypeId:
The id of the HVAC system type.
ductTypeId:
The id of the flexible duct.
levelId:
The level id for the flexible duct.
points:
The point array indicating the path of the flexible duct, including the end point.
Returns:
If creation was successful then a new flexible duct is returned, otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid HVAC system type.
-or-
The type ductTypeId is not valid flexible duct type.
-or-
The level id levelId is not valid.
-or-
The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014